__Lab Day-4__
enable => enable the privilege exec mode

configure terminal => it will go to global terminal configuration

exit => comes out

hostname (name) => it will change hostname of device

enable password (password-name) => it will set password with password-name 

show running-config => shows all the running configuration of global terminal 

configuration (it only works in privilege exec mode)

1.conf t 2. service password-encryption => it will enable encrypting password service

R1(config)# do show run => do runs the privilege codes in config mode

R1(config)# enable secret (secret-name) => more secure way of protecting router configuration

R1# write memory or write or copy running-config startup-config => it will save the configuration in startup-config or device

__Lab Day-6__
SW1# show mac address-table => shows the mac address table of switch with their relative interfaces

__Lab Day-8__
Router# show ip interface brief => it will show the interfaces and ip-addresses assign to them

R1(config) #interface gigabitEthernet 0/0 => it will go to configuration of that specific interface

R1(config-if)# ip address (ip address) (mask) => it will set the ip with its mask to that interface to be sent from that
R1(config-if)# description (## description ##) => sets descriptions
R1(config-if)#no shutdown => enables the interface

R1(config-if)#int g0/1 => to switch to other interface which in this case is g0/1

R1(config-if)# end => it will go directly to privilege mode

note:
remember to write memory the configurations

__Lab Day-9__
R1(config-if) #speed (speed in mg) => will set speed of that interface

R1(config-if) # duplex (type) => will set the duplex type of the interface

R1(config-if) #int range g0/1 -2 => will select interface range 1 to 2
R1(config-if-range) # description ## not in use ## => it will set this description to all in the selected range

#show start config => it will show startup-configurations 

#do show interface status => shows swtich interfaces (work only in switches)

__Lab Day-11 (part1)__

R1(config) #ip route (ip address) (mask) (interface or ip of the interface => it determines routes for IPs that are away from router (next hop should be declared if ip is being in used)

R1(config) #do show ip route => it shows the interfaces and routes status

__Lab Day-11 (part2)__
in pc terminal, ipconfig /all => it shows information about macs and IPs

no ip route (ip address) (mask) (hop/interface) => it will delete that route

show run | include ip route => it will show ip routes that are in set in router

note: sometime the routing can be wrong and sometimes even ip of each interface can go wrong. be cautious!

__Lab Day-12__
use show interface (interface name) to see mac address of that interface
use ipconfig /all in PCs to see their mac address in CLI


__Lab Day-15__
show ip interface (interface name) => it will show information about the ip and other property of that interface


__Lab Day-16__

for creating Vlan among switch port and a router we can do such action for range of intefaces.
however it is simple and not really that common to do.

(confing)# range g0/1, f3/1 , f4/1 => selecting targeted interfaces
(config-if-range)# switchport mode access => it enable switchport mode to access for the range that is selected
(config-if-range)# switchport access vlan 10 => it assigns the vlan to it which in this case is 10

# show vlan brief => it will show vlan status

(config)# vlan (number of vlan) => it will go to that vlan configuration
(config-vlan)#name (name-of-vlan) => sets a name for that vlan

__Lab Day-17___

(config-if (g0/1))# switchport trunk allowed vlan (vlan numbers,) => to set trunk for vlans that are in switch and want to be connected to other switches

note: in cisco most of switches are default in Dot1q but it some senarios it should be set

#swtichport trunk native vlan 1001 => set native vlan for switch

#show interface trunk => show trunk interfaces

in router for trunking:
R1(config) # g0/0.10 => setting vlan in this case vlan 10
R1(config-subif) # encaupsulation dot1q 10 => enables encapsulation for vlan
R1(config-subif)# ip address (ip address) (mask) => sets ip and mask for vlan port

__Lab Day-18__

# show run => it shows all configurations that are being run
# show ip interface brief => to list all interfaces with vlans included

R1(config)# no interface g0/0.10 => to remove vlan 10 interface from router

SW2(config)# default interface g1/0/2 => it sets the interface to default configuration

in switch with multiplayer (layer 3) for changing interface configuration we need to pay attention to enable that interface port to be set for layer 3 configurations
command:
SW2(config-if) # no switchport => it will change the layer 2 to layer 3

in multilayer switches, IP routing needs to be activated before being used.
command:
(config) # ip routing => it will enable the routing mode

SVI can be created for vlan by this command:
interface vlan 10
note: in some cases no shutdown for SVIs are required
